#### BuiltInFailures.MatchlineFailures Members

---

|  |
| --- |
| BuiltInFailures MatchlineFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures MatchlineFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CreationFailed | Matchline top extent should be higher than its bottom. |

# See Also

BuiltInFailures MatchlineFailures Class

Autodesk.Revit.DB Namespace